In [1]:
import numpy as np
import pandas as pd

In [5]:
df = pd.read_excel(r"D:\Coding\Data-Prep-EDA\Code\Data\Student Grades.xlsx")
df.head()

  Student             Class      Year  Grade
0    Emma  Freshman Seminar  Freshman   86.0
1  Olivia  Freshman Seminar  Freshman   86.0
2    Noah  Freshman Seminar  Freshman   86.0
3  Sophia  Freshman Seminar  Freshman   87.0
4    Liam  Freshman Seminar  Freshman   90.0

In [6]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
      ...
81    False
82    False
83    False
84    False
85    False
Length: 86, dtype: bool

In [7]:
df.duplicated().sum()

2

In [9]:
df[df.duplicated()]

   Student         Class       Year  Grade
43   Isaac  Intro to SQL  Sophomore   96.0
44   Isaac  Intro to SQL  Sophomore   96.0

In [10]:
df[df.duplicated(keep=False)]

   Student         Class       Year  Grade
42   Isaac  Intro to SQL  Sophomore   96.0
43   Isaac  Intro to SQL  Sophomore   96.0
44   Isaac  Intro to SQL  Sophomore   96.0